{
  "pageDescription": "",
  "members": [
    {
      "bio": "Peter is the Chief Executive Officer, founder, and managing member of\nAuxano Advisors. He provides strategic direction for the entire\norganization and specific leadership for the team of client service\nprofessionals. \n\n\nPeter has over three decades of experience providing strategic financial\nadvice to affluent families. He began his investment career in 1987 when\nhe founded the predecessor firm to Auxano Advisors. Peter has guided the\nfirm since its inception into a distinguished wealth management\norganization. Peter has received a number of industry honors throughout\nhis career for exemplary service to clients. \n\n\nPeter is a Certified Financial Planner (CFP®) and a graduate of the\nCollege for Financial Planning. He has completed the Executive Education\nprogram at Harvard University in Investment Decisions and Behavioral\nFinance. \n\n\nPeter is active in a number of charitable organizations, some of which\ninclude serving on the board of C3, a regional business leadership\ndevelopment forum, and was a long time volunteer at St. Joseph’s men’s\nshelter in Seattle. \n\n\nPeter is married to Linda, and they have three children.",
      "email": "peter@auxanoadvisors.com",
      "extension": "",
      "image": "/uploads/Peter.jpg",
      "isStrategicPartner": false,
      "positions": [
        "Founder",
        "CEO"
      ],
      "qualifications": [
        "CFP®"
      ],
      "title": "Peter Cline"
    },
    {
      "bio": "Alex is a Client Advisor and Member with Auxano Advisors. He serves a wide variety of clients including those with multi-generational wealth as well as the newly wealthy. He has extensive expertise working with families that own substantial real estate holdings. He brings tremendous industry acumen to the practice of solving complex financial questions for clients. His expertise in serving affluent clients was recognized in 2007 and 2008 when he was awarded the industry honor: FIVE STAR Wealth Manager - Best in Client Satisfaction. This honor was given to the top 3% of wealth managers in the greater Seattle area.\n\nPrior to joining Auxano in 2002, he served as a financial advisor to\naffluent families at Waddell & Reed for a period of 10 years. At Waddell, Alex was awarded the Pacesetter distinction and Circle awards for outstanding achievement.\n\nAlex earned a BA in Economics from the University of Washington. Alex is a Certified Financial Planner (CFP®) and a graduate of the College for Financial Planning. Alex is a former board member of the Deaf-Blind Service Center and the Husky Marching Band Alumni Association. Alex currently serves as the Treasurer on the endowment Board of Governors for Cascadia Community College.",
      "email": "alex@auxanoadvisors.com",
      "extension": "",
      "image": "/uploads/alex.jpg",
      "isStrategicPartner": false,
      "positions": [
        "Partner",
        "Client Advisor"
      ],
      "qualifications": [
        "CFP®"
      ],
      "title": "Alex Lee"
    },
    {
      "bio": "Dwight is a family wealth advisor, managing generational wealth for his extended family.  He combines an extensive twenty-year business and engineering background with nearly two decades in the wealth management profession. \n\nPrior to joining Auxano, Dwight held key leadership positions at Morgan Stanley as a wealth advisor and portfolio manager. Dwight was actively engaged in developing customized solutions for his clients’ financial needs. He also led the investment research efforts of the team with an emphasis on alternative investments. Dwight previously served in a similar role at UBS, providing financial and investment counsel to clients.\n\nBefore entering the wealth management profession, Dwight worked in the alternative energy industry at Dynalco Controls and IMPCO Technologies. He held senior leadership positions in engineering and international sales and marketing. He worked as an applications engineer, embedded systems engineer, product manager and program manager overseeing global engineering and marketing teams.\n\nDwight earned an MS in Aeronautics and Astronautics from Stanford University and a BS in Systems Science and a BA in Management Science at the University of California at San Diego. During his college and business career, Dwight has lived and worked in France, Germany and Switzerland. He is fluent in French and German. He and his wife, Mary, have three adult children.  Dwight currently serves on the Board of Directors of Emerald Communities, a not-for-profit corporation that owns and operates two life plan, or continuing care retirement communities in Washington state:  Emerald Heights, in Redmond and Heron’s Key, in Gig Harbor.",
      "email": "",
      "extension": "",
      "image": "/uploads/Dwight.jpg",
      "isStrategicPartner": false,
      "positions": [
        "Family Wealth Advisor"
      ],
      "qualifications": [
        ""
      ],
      "title": "Dwight S. Whiting"
    },
    {
      "bio": "Brian serves as the Director of Operations at Auxano Advisors. This is an\nessential role to ensure that the business runs smoothly and that we are\nable to provide an outstanding client experience. Brian is responsible for\noverseeing a wide variety of operational functions at the firm including\nclient trading, portfolio accounting and reporting, risk management and\nother back office functions. In addition, he serves as the firm's\ncompliance manager responsible for adhering to all SEC regulatory\nrequirements and supports the firm’s HR and IT functions along with our\nlong-range strategic planning objectives.\n\n\nBrian joined Auxano in 1993 and has served as a financial advisor and\ninsurance specialist during his career.\n\n\nBrian holds a BA in Business Administration from Washington State\nUniversity. He is currently a student at the College for Financial\nPlanning in pursuit of the Certified Financial Planner (CFP®)\ncertification.",
      "email": "brian@auxanoadvisors.com",
      "extension": "",
      "image": "/uploads/Brian.jpg",
      "isStrategicPartner": false,
      "positions": [
        "Director of Operations"
      ],
      "qualifications": [
        ""
      ],
      "title": "Brian Hill"
    },
    {
      "bio": "Shari is a member of the Client Advisory team at Auxano Advisors. She\nworks with the firm’s valued clients to facilitate financial relationships\nand support the operational management needs of the organization.\n\n\nPrior to joining Auxano in 2015, Shari’s role as a Real Estate Broker was\ncomprised of a 4-person team recognized in 2014 Best Realtors in the US.\nIn her most recent role in listing and business development Shari worked\nwith her team to achieve the Top 1% Realtors Designation, working with\nover 200 clients to successfully manage their real estate holdings and\nnavigate the process of selling their homes. Shari is extremely attentive,\nresponsive, and thorough in providing a high level of client service,\nmanagement, and communication.\n\n\nShari earned her Bachelor of Arts degree in Psychology from Northwest\nUniversity and received a Dean’s list honor. Shari is continuing to pursue\nher advanced education and CFP® certification. Serving as a facilitator\nand volunteer for several non-profit agencies throughout the Puget Sound,\nShari assists individuals in overcoming challenges to fulfill their life\ngoals and further education. Outside of work, she enjoys spending time\nwith her daughters rock climbing and paddle boarding.",
      "email": "shari@auxanoadvisors.com",
      "extension": "",
      "image": "/uploads/Shari.jpg",
      "isStrategicPartner": false,
      "positions": [
        "Director of Client Services"
      ],
      "qualifications": [
        ""
      ],
      "title": "Shari Bonnell"
    },
    {
      "bio": "Davis is a member of the Client Advisory team at Auxano Advisors. He works\nwith the firm’s valued clients to facilitate financial relationships and\nsupport the operational management needs of the organization. \n\n\nPrior to joining Auxano in 2017, Davis served as an Investment Advisor\nAssociate with a financial services firm in Bellevue, where he supported\nfinancial advisors in caring for clients, including creating financial\nplans. Davis enjoys working with clients, providing solutions, solving\nproblems and helping them manage their financial lives. \n\n\nDavis earned his Bachelors in Business Administration from the University\nof Washington Bothell. \n\n\nOutside of work, Davis enjoys the outdoors, playing and watching sports,\nand spending time with family and friends.",
      "email": "davis@auxanoadvisors.com ",
      "extension": "",
      "image": "/uploads/davis.jpg",
      "isStrategicPartner": false,
      "positions": [
        "Client Advisor"
      ],
      "qualifications": [
        "CFP®"
      ],
      "title": "Davis Walker"
    },
    {
      "bio": "Dan is an integral member of the Client Advisory team at Auxano. With his expertise and dedication, Dan crafts tailored strategies to empower our clients in reaching their financial goals with confidence. \n\nDrawing from ten years of experience working with high net-worth individuals, with a background in insurance and personal finance, Dan is committed to client satisfaction. He diligently guides clients through the financial and investment planning journey, ensuring a personalized experience.\n\nDan is a CFP® Professional and holds a Bachelor of Science degree in Business Administration from Thomas Edison State University.\n\nOutside of the office, Dan enjoys music, hiking and outdoor adventures, volleyball, and other team sports.",
      "email": "daniel@auxanoadvisors.com",
      "extension": "",
      "image": "/uploads/Dan.jpg",
      "isStrategicPartner": false,
      "positions": [
        "Client Advisor"
      ],
      "qualifications": [
        "CFP®"
      ],
      "title": "Dan Anderson"
    },
    {
      "qualifications": [
        "CFP®"
      ],
      "bio": "Before joining Auxano in 2020, Jared spent the last 18 years in the retail banking world. Jared's diverse roles included responsibilities as a Small Business Specialist, Relationship Manager and, most recently, Branch Manager. Prior to that, he served 5 years at Cornerstone Advisors, Inc. as the Client Portfolio Administrator. Jared's contributions to the Cornerstone investment team included portfolio accounting, investment performance reporting, trading and research.\n\nJared is a Washington native but earned his Bachelor of Arts Degree in Finance from Hillsdale College in Hillsdale, Michigan.\n\nIn addition to raising 5 children, Jared is an avid runner in his time off. He recommends the Sammamish River trail for its peaceful setting away from the city.",
      "positions": [
        "Client Advisor"
      ],
      "isStrategicPartner": false,
      "partnerCompany": "",
      "title": "Jared Davis",
      "image": "/uploads/jared.jpg",
      "email": "jared@auxanoadvisors.com",
      "extension": ""
    },
    {
      "qualifications": [
        ""
      ],
      "bio": "Lesley is a member of the Client Advisory team at Auxano Advisors. She works directly with the firm’s valued clients to create financial relationships and support the operational and office management needs of the organization.\n\nPrior to joining Auxano, Lesley previously worked supporting commercial real estate portfolios and their asset management teams. She has considerable experience in customer service and looks forward to meeting clients and exceeding their expectations with prompt and responsive assistance. Lesley’s commitment to planning and organizing will provide Auxano clients with the highest level of support.\n\nLesley is an Eastside native who earned her Bachelor of Arts degree in Communications/Advertising from the University of Washington. Lesley has three grown children, and outside of work enjoys an active lifestyle along with many creative endeavors in the arts.",
      "positions": [
        "Associate"
      ],
      "isStrategicPartner": false,
      "partnerCompany": "",
      "title": "Lesley Johnson",
      "image": "/uploads/lesley.jpg",
      "email": "lesley@auxanoadvisors.com",
      "extension": ""
    },
    {
      "qualifications": [
        ""
      ],
      "bio": "Grayson is a member of the Client Advisory Team at Auxano and helps support the operations at our Firm. Grayson works alongside our Client Advisors to help find practical solutions for our client's financial life planning. He enjoys designing financial plans for clients that streamline their lives and transform their future.\n\nPrior to joining Auxano, Grayson worked as a Technical Consultant to Microsoft, Tableau and Google.\n\nIn his free time, Grayson enjoys coding, woodworking, welding and hiking.",
      "positions": [
        "Client Advisor"
      ],
      "isStrategicPartner": false,
      "partnerCompany": "",
      "title": "Grayson Unger",
      "image": "/uploads/grayson-unger2-oct2021-jennyjimenez-squared.jpg",
      "email": "grayson@auxanoadvisors.com",
      "extension": ""
    },
    {
      "bio": "Anam is our newest member of the Client Advisory Team at Auxano Advisors. She works closely with the firm's valued clients, facilitating financial transactions and follow-through on mission-critical tasks, ensuring that clients are delighted with their experience. \n\nPrior to joining Auxano, Anam previously worked as an Executive Administrative Assistant at Churchome. She worked alongside teams to assist in planning, organizing and executing the heart and vision of the organization. She is passionate about customer service and building relationships and looks forward to meeting clients and helping them on their financial journey at Auxano Advisors.\n\nAnam enjoys playing volleyball, reading historical fiction novels, makeup artistry and spending time with her family and friends.",
      "email": "anam@auxanoadvisors.com",
      "extension": "",
      "image": "/uploads/anam-masih-11192021-13854-squared.jpg",
      "isStrategicPartner": false,
      "positions": [
        "Associate"
      ],
      "qualifications": [
        ""
      ],
      "title": "Anam Masih"
    },
    {
      "bio": "Drew is a Senior Investment Analyst with Auxano Advisors and member of the\nfirm’s Investment Policy Committee. He conducts extensive manager and\nasset class research including onsite due diligence, conference calls and\ncapital market analysis. His research findings are presented to and\ndebated among members of the firm’s Investment Policy Committee. Drew is\nalso responsible for overseeing the firm’s state-of-the-art trading and\nportfolio management platform used to implement investment decisions\nacross the firm’s client base.\n\n\nDrew joined Auxano Advisors in 2011 after three years at Laird Norton\nTyee, a wealth management firm in Seattle responsible for $4 billion in\nclient assets at that time.\n\n\nDrew earned a BA in Business Administration with an emphasis in Finance\nfrom Seattle Pacific University where he was also co-captain of the men’s\nbasketball team and received Great Northwest Athletic Conference\nAll-Academic Team honors for three years. Drew has successfully completed\nthe rigorous Chartered Financial Analyst (CFA®) Program in global\ninvestment analysis, portfolio management, ethics and wealth planning; and\nhas earned the right to use the CFA designation. Drew is also a member of\nthe CFA Society of Seattle and the CFA Institute.",
      "email": "drew@auxanoadvisors.com",
      "extension": "",
      "image": "/uploads/Drew.jpg",
      "isStrategicPartner": false,
      "positions": [
        "Senior Investment Analyst | Client Advisor"
      ],
      "qualifications": [
        "CFA®"
      ],
      "title": "Drew Matzen"
    },
    {
      "bio": "Blue Kayak Partners, founded by Jon Pinkston, provides non-discretionary investment research to Auxano Advisors in areas such as asset allocation, manager review, and macro analysis. Blue Kayak’s approach is based on the philosophy that because global capital markets are inefficient, and prices do not always reflect fair value, excess returns can be generated. Investor psychology — particularly overconfidence, pride and the tendency to avoid regret — explains not only the oscillation between fear and greed but also the propensity to avoid value stocks, to sell winners too early, and to hold onto losing positions. Simply put, investors often under- or overreact to new information. Blue Kayak believes that an intelligent combination of quantitative measures and informed judgment may provide opportunity for achieving superior investor returns through a systematic discipline to engage the periodic irrationality of markets.",
      "extension": "",
      "image": "/uploads/jon-pinkston.jpg",
      "isStrategicPartner": true,
      "partnerCompany": "Blue Kayak Partners, LLC",
      "positions": [
        "Founder",
        "CIO"
      ],
      "qualifications": [
        ""
      ],
      "title": "Jon Pinkston"
    },
    {
      "qualifications": [
        ""
      ],
      "bio": "Regan Cline has joined the Client Advisory team at Auxano Advisors as a Senior Associate Advisor. Regan contributes across multiple areas of the firm's operations while supporting the broader team in delivering high-quality service and tailored advice to our clients.\n\nPrior to joining Auxano Advisors, Regan was an Associate at Seidler Equity Partners, a private equity firm in Los Angeles, where he evaluated and managed investments across a range of industries. Earlier in his career, he held financial analyst roles at Amazon, supporting teams across core business units, and gained valuable experience in venture capital and operations finance through internships during his undergraduate studies.\n\nRegan brings a strong analytical foundation, a deep understanding of private investments, and a commitment to helping clients achieve their goals through thoughtful, customized strategies. He holds a Bachelor of Fine Arts in Finance from the University of Washington's Foster School of Business, with a minor in Nutrition. Outside of work, Regan enjoys running, cooking, and exploring hiking trails throughout the Pacific Northwest.",
      "positions": [
        "Senior Associate Advisor"
      ],
      "isStrategicPartner": false,
      "partnerCompany": "",
      "title": "Regan Cline",
      "image": "/uploads/regan.jpg",
      "email": "regan@auxanoadvisors.com",
      "extension": ""
    },
    {
      "qualifications": [
        ""
      ],
      "bio": "Rose is a member of the Client Advisory team at Auxano Advisors. She personalizes the client experience, ensuring the firm keeps its commitments while acting as a bridge between clients and the Client Advisors. She combines her passion for building strong client relationships and marketing and branding initiatives, supporting client communications, and bringing value to both clients and internal teams.\n\nPrior to originally joining Auxano in 2007, Rose served as a project manager for Nishimura Associates, LLC for four years. In this capacity, Rose assisted in managing significant business relationships with over 30 clients engaged in major commercial development projects. She represented client interests diligently with various City and State leaders in moving projects through the development process. \n\nOutside of work, Rose stays active with her three children, husband and Aussie Doodle, Ralphy. She holds an Associates of Arts degree in Theology from Christian Life School of Theology.",
      "positions": [
        "Client Service and Marketing Associate"
      ],
      "isStrategicPartner": false,
      "partnerCompany": "",
      "title": "Rose Kline",
      "image": "/uploads/Rose.jpg",
      "email": "rose@auxanoadvisors.com",
      "extension": ""
    },
    {
      "qualifications": [
        ""
      ],
      "bio": "Anthony is a member of the Client Advisory team at Auxano Advisors. He provides essential administrative, financial, and client service support, orchestrating efficiency across all company operations.\n\nAnthony joined Auxano full-time after serving as an Associate Intern during his final year at Northwest University, where he earned a B.A. in Business Administration. He brings a strong work ethic, a collaborative spirit, and a passion for building meaningful relationships. Driven by a genuine interest in investments and a desire to serve, Anthony is continuing to pursue his advanced education and CFA® designation.\n\nOutside the office, Anthony enjoys skiing, surfing, hiking, and watching sports while spending quality time with friends and family.",
      "positions": [
        "Associate"
      ],
      "isStrategicPartner": false,
      "partnerCompany": "",
      "title": "Anthony Scherrer",
      "image": "/uploads/anthony-cropped-for-website.jpg",
      "email": "anthony@auxanoadvisors.com",
      "extension": ""
    },
    {
      "qualifications": [
        ""
      ],
      "bio": "Hanna is the newest member of the Client Advisory Team at Auxano Advisors. She plays a key role in supporting the firm's valued clients by coordinating financial transactions and overseeing essential tasks, ensuring a seamless and exceptional client experience.\n\nPrior to joining Auxano, Hanna previously worked as an Executive Administrative Assistant at Olson Investment Advisors, LLC. She provided attentive, detail-oriented support to clients and played a key role in managing day-to-day office operations. Her responsibilities included shared oversight of administrative functions, ensuring organizational efficiency, and responding proactively to evolving business needs. Hanna is passionate about serving clients with care, professionalism, and a commitment to building lasting relationships.\n\nHanna holds a Bachelor of Arts in Psychology with concentrations in Industrial and Organizational Psychology, Counseling, and Marriage and Family Counseling from Northwest University in Kirkland. Outside of work, she enjoys spending quality time with family and friends, reading, and exploring new places through travel.",
      "positions": [
        "Associate"
      ],
      "isStrategicPartner": false,
      "partnerCompany": "",
      "title": "Hanna Chernenko",
      "image": "/uploads/hanna-chernenko-cropped-for-website.jpg",
      "email": "hanna@auxanoadvisors.com",
      "extension": ""
    }
  ]
}
